uhnp/src/Documents/ИзменениеПретензии/ИзменениеПретензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеПретензии</name>
  <basedOn>Catalog.ПретензииУХ</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>InformationRegister.ХодПретензионноИсковойРаботы</registerRecords>
  <registerRecords>InformationRegister.ВерсииГрафиковРасчетов</registerRecords>
  <attributes>
    <name>Претензия</name>
    <type>
      <types>CatalogRef.ПретензииУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПретензии</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПозицияОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПозицияКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Суд</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Судья</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОжидаемогоВозвратаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующийЭтапПретензии</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВ_БДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаШтрафа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаИзмененияЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПретензия</name>
    <type>
      <types>CatalogRef.Претензии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПредметаСпора</name>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DefinedType.РасчетныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ОтражениеФактическихДанныхБюджетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>DefinedType.ОбъектРасчетовУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Пени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штраф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейПросрочки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <comment>Сумма с учетом вероятности</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ХодПретензионноИсковойРаботы/ХодПретензионноИсковойРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодПретензионноИсковойРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЭтапРаботы</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПозицияОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПозицияКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Суд</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Судья</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>НомерДела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодПланирования</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>Пени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ОжидаемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующийЭтапПретензии</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Претензия</name>
    <type>
      <types>CatalogRef.ПретензииУХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыПретензий/ТипыПретензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПретензий</name>
  <enumValues>
    <name>Исходящая</name>
  </enumValues>
  <enumValues>
    <name>Входящая</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ЭтапыПретензионноИсковойРаботы/ЭтапыПретензионноИсковойРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПретензионноИсковойРаботы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Досудебные</name>
      <description>Досудебные</description>
    </items>
    <items>
      <name>Суд</name>
      <description>Суд</description>
    </items>
    <items>
      <name>Факторинг</name>
      <description>Факторинг</description>
    </items>
    <items>
      <name>Закрыта</name>
      <description>Закрыта</description>
    </items>
  </predefined>
  <attributes>
    <name>ВероятностьПогашенияПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ПретензииУХ/ПретензииУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПретензииУХ</name>
  <basedOn>Catalog.Лоты</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтражениеФактическихДанныхБюджетирования</basedOn>
  <basedOn>Document.АккредитацияПоставщика</basedOn>
  <basedOn>Document.КвалификацияПоставщика</basedOn>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <attributes>
    <name>ТипПретензии</name>
    <type>
      <types>EnumRef.ТипыПретензий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСпора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВ_БДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованияПретензий</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Documents/ИзменениеПретензии/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных
&НаКлиенте
Перем ОтветПередЗакрытием;
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтражаетсяВБДДС = НЕ Объект.НеОтражаетсяВ_БДДС;
	
	// Заполнение реквизитов формы при открытии
	Если НЕ Объект.Претензия.Пустая() Тогда
		Претензия = Объект.Претензия;
	ИначеЕсли НЕ Параметры.Претензия.Пустая() Тогда
		Претензия = Параметры.Претензия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Основание) Тогда
		Основание = Параметры.Основание;
	КонецЕсли; 
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Лоты") Тогда
		ТипПретензии = Перечисления.ТипыПретензий.Входящая;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Претензия) Тогда
		РеквизитыПретензия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Претензия,  "Основание,ТипПретензии,Наименование,ПредметСпора");
		Если Не ЗначениеЗаполнено(Основание) Тогда
		    Основание = РеквизитыПретензия.Основание;		
		КонецЕсли;
		ТипПретензии = РеквизитыПретензия.ТипПретензии;
		Наименование = РеквизитыПретензия.Наименование;
		ПредметСпора = РеквизитыПретензия.ПредметСпора;
	Иначе
		Если Не ЗначениеЗаполнено(ТипПретензии) Тогда
			ТипПретензии = Перечисления.ТипыПретензий.Исходящая;
		КонецЕсли;
		ПретензионноИсковаяРабота.АвтозаголовокПретензии(ЭтаФорма, Объект.РасшифровкаПредметаСпора, Основание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЭтапПретензии) Тогда
		Если Объект.ЭтапПретензии.ПринадлежитЭлементу(Справочники.ЭтапыПретензионноИсковойРаботы.Суд) Тогда
			КэшЭтаповПринадлежностиСуду.Добавить(Объект.ЭтапПретензии);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Претензия.Пустая() Тогда
			Элементы.ГруппаНовая.Видимость = Истина;
			Элементы.ГруппаВерсия.Видимость = Ложь;
		Иначе
			Элементы.ГруппаНовая.Видимость = Ложь;
			Элементы.ГруппаВерсия.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаНовая.Видимость = Истина;
		Элементы.ГруппаВерсия.Видимость = Ложь;
	КонецЕсли;
	
	УстановкаОтборовИДоступности();  
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОЗаписиНового(Объект.Претензия);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Претензия.Пустая() Тогда
		НоваяПретензия = Справочники.ПретензииУХ.СоздатьЭлемент();
		НоваяПретензия.Наименование = Наименование;
		НоваяПретензия.Организация = Объект.Организация;
		НоваяПретензия.Контрагент = Объект.Контрагент;
		НоваяПретензия.ТипПретензии = ТипПретензии;
		НоваяПретензия.ПредметСпора = ПредметСпора;
		НоваяПретензия.Основание = Основание;
		НоваяПретензия.Записать();
		Претензия = НоваяПретензия.Ссылка;
	КонецЕсли;   
	
	Если Не Объект.НеОтражаетсяВ_БДДС Тогда
		ТекущийОбъект.Сумма = Объект.РасшифровкаПредметаСпора.Итог("Итого");
	КонецЕсли;  
	
	ТекущийОбъект.Претензия = Претензия.Ссылка;   
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановкаОтборовИДоступности();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтапПретензииПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ТипПретензииПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПроцентОжидаемогоВозвратаДолгаПриИзменении(Элемент)
	
	Если Объект.ПроцентОжидаемогоВозвратаДолга > 100 Тогда
		Объект.ПроцентОжидаемогоВозвратаДолга = 100;
	КонецЕсли;
	
	Для каждого Строка Из Объект.РасшифровкаПредметаСпора Цикл
		Строка.Итого = Строка.Всего * Объект.ПроцентОжидаемогоВозвратаДолга / 100;
	КонецЦикла;
	
	Объект.Сумма = Объект.РасшифровкаПредметаСпора.Итог("Итого");  
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(ПредметСпора) Тогда
		ПредметСпора = Наименование;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура СутьСпораПриИзменении(Элемент)
	
	Если ПустаяСтрока(Наименование) Тогда 
		Наименование = ПредметСпора;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура Основание1ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Основание) Тогда
		ТекстВопроса = НСтр("ru = 'Заполнить претензию на основании выбранного значения?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("Основание1ПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20);
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПоследнююВерсию(Команда)
	
	Если Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Форма уже была изменена. Отказаться от редактирования текущей версии и перейти к редактированию предыдущей?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("РедактироватьПоследнююВерсиюЗавершение2", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СсылкаНаВерсию = ПолучитьПоследнююВерсиюНаСервере(Объект.Ссылка, Претензия);
		Если ЗначениеЗаполнено(СсылкаНаВерсию) Тогда
			ПоказатьЗначение(, СсылкаНаВерсию);
			Закрыть();
		КонецЕсли;
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПоследнююВерсиюЗавершение2(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		СсылкаНаВерсию = ПолучитьПоследнююВерсиюНаСервере(Объект.Ссылка, Претензия);
		
		Если ЗначениеЗаполнено(СсылкаНаВерсию) Тогда
			ПоказатьЗначение(, СсылкаНаВерсию);
			Модифицированность = Ложь;
			Закрыть();
		КонецЕсли;   
		
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПениИШтрафы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Новая версия претензии не записана'"));
		Возврат;
	КонецЕсли;  
	
	ТекстВопроса = НСтр("ru = 'Таблица будет перезаполнена. Продолжить?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПениИШтрафыЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПениИШтрафыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПениИШтрафыНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражаетсяВБДДСПриИзменении(Элемент)

	Объект.НеОтражаетсяВ_БДДС = Не ОтражаетсяВБДДС;
	УправлениеФормой();   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПредметаСпора

&НаКлиенте
Процедура РасшифровкаПредметаСпораСуммаПриИзменении(Элемент)
	
	Элементы.РасшифровкаПредметаСпора.ТекущиеДанные.Всего = Элементы.РасшифровкаПредметаСпора.ТекущиеДанные.Сумма 
				+ Элементы.РасшифровкаПредметаСпора.ТекущиеДанные.Пени + Элементы.РасшифровкаПредметаСпора.ТекущиеДанные.Штраф;
	Элементы.РасшифровкаПредметаСпора.ТекущиеДанные.Итого = Элементы.РасшифровкаПредметаСпора.ТекущиеДанные.Всего 
				* Объект.ПроцентОжидаемогоВозвратаДолга / 100;
	
	Объект.Сумма = Объект.РасшифровкаПредметаСпора.Итог("Итого");  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановкаОтборовИДоступности()
	
	ЭлементыОтбораИзменений = Изменения.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Если ЭлементыОтбораИзменений.Количество() > 0 Тогда
		ПервыйЭлементОтбора = ЭлементыОтбораИзменений[0];
	Иначе	
		ПервыйЭлементОтбора = ЭлементыОтбораИзменений.Добавить();
		ПервыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Претензия");
		ПервыйЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если НЕ Претензия.Пустая() Тогда
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.ТипПретензии.ТолькоПросмотр = Истина;
		ПервыйЭлементОтбора.ПравоеЗначение = Претензия;
	Иначе
		ПервыйЭлементОтбора.ПравоеЗначение = Неопределено;
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.ГруппаАналитикаБюджетирования.Видимость = НЕ Объект.НеОтражаетсяВ_БДДС;
	Элементы.ГруппаОснование.Видимость = Объект.НеОтражаетсяВ_БДДС;
	Элементы.Основание.Видимость = Объект.НеОтражаетсяВ_БДДС И ЗначениеЗаполнено(Основание);
	Элементы.Основание1.Видимость = Объект.НеОтражаетсяВ_БДДС И НЕ ЗначениеЗаполнено(Основание);
	Элементы.ГруппаОрганизация.Заголовок = 
		?(ТипПретензии = ПредопределенноеЗначение("Перечисление.ТипыПретензий.Входящая"), НСтр("ru = 'Ответчик'"), НСтр("ru = 'Заявитель'"));
	Элементы.ГруппаКонтрагент.Заголовок = 
		?(ТипПретензии = ПредопределенноеЗначение("Перечисление.ТипыПретензий.Входящая"), НСтр("ru = 'Заявитель'"), НСтр("ru = 'Ответчик'"));
	
	Если ЗначениеЗаполнено(Объект.ЭтапПретензии) Тогда
		ЗначениеИзКэша = КэшЭтаповПринадлежностиСуду.НайтиПоЗначению(Объект.ЭтапПретензии);
		Если ЗначениеИзКэша = Неопределено Тогда
			Элементы.ГруппаСуд.Видимость = ОпределениеПринадлежностиКЭтапуСуд(Объект.ЭтапПретензии, КэшЭтаповПринадлежностиСуду);
		Иначе
			Элементы.ГруппаСуд.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаСуд.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаЗакрытие.Видимость 
	= (Объект.ЭтапПретензии = ПредопределенноеЗначение("Справочник.ЭтапыПретензионноИсковойРаботы.Закрыта"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределениеПринадлежностиКЭтапуСуд(Этап, Кэш)
	
	Результат = Этап.ПринадлежитЭлементу(Справочники.ЭтапыПретензионноИсковойРаботы.Суд);
	Если Результат Тогда
		Кэш.Добавить(Этап);
	КонецЕсли;
	
	Возврат Результат;   
	
КонецФункции

&НаКлиенте
Процедура РасшифровкаПредметаСпораДокументОснованиеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасшифровкаПредметаСпора.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектВыбора = ТекущаяСтрока.ДокументОснование;
	
	Если Не ЗначениеЗаполнено(ОбъектВыбора) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектВыбора) = Тип("ДокументСсылка.ОтражениеФактическихДанныхБюджетирования") Тогда 
		Реквизиты = ОбщегоНазначенияУХ.ЗначенияРеквизитовОбъекта(ОбъектВыбора, "ДоговорКонтрагента, ВалютаДокумента, 
							|ОбъектРасчетов, СуммаДокумента, ДоговорКонтрагента.СтатьяДвиженияДенежныхСредств");
		ТекущаяСтрока.СтатьяДвиженияДенежныхСредств = Реквизиты.ДоговорКонтрагентаСтатьяДвиженияДенежныхСредств;
		ТекущаяСтрока.ОбъектРасчетов = Реквизиты.ОбъектРасчетов;
		ТекущаяСтрока.Сумма = Реквизиты.СуммаДокумента;
		ТекущаяСтрока.Валюта = Реквизиты.ВалютаДокумента;
		ТекущаяСтрока.Всего = ТекущаяСтрока.Сумма + ТекущаяСтрока.Пени + ТекущаяСтрока.Штраф;
		ТекущаяСтрока.Итого = ТекущаяСтрока.Всего * Объект.ПроцентОжидаемогоВозвратаДолга / 100;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Основание1ПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Основание1ПриИзмененииНаСервере();
		УправлениеФормой();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура Основание1ПриИзмененииНаСервере()
	
	ОбъектСервера = РеквизитФормыВЗначение("Объект");
	ОбъектСервера.Заполнить(Основание);
	ЗначениеВРеквизитФормы(ОбъектСервера, "Объект");    
	
КонецПроцедуры

// Выполняет перезапись исходной претензии по данным формы. Возвращает 
// успешность выполнения операции.
&НаСервере
Функция ОбновитьПретензию()
	
	РезультатФункции = Истина;
	
	Попытка
		ОбновитьПретензию = Претензия.ПолучитьОбъект();
		ОбновитьПретензию.Наименование = Наименование;
		ОбновитьПретензию.Организация = Объект.Организация;
		ОбновитьПретензию.Контрагент = Объект.Контрагент;
		ОбновитьПретензию.ТипПретензии = ТипПретензии;
		ОбновитьПретензию.ПредметСпора = ПредметСпора;
		ОбновитьПретензию.Основание = Основание;
		ОбновитьПретензию.Записать();
	Исключение
		ТекстСообщения = НСтр("ru = 'Возникли ошибки при обновлении претензии %Претензия%: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Претензия%", Строка(Претензия));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		РезультатФункции = Ложь;
	КонецПопытки;
	
	Возврат РезультатФункции;  
	
КонецФункции

// Проверяет совпадение реквизитов Контрагент и Организация с сохраненными в БД.
&НаСервере
Функция СовпадаютОсновныеРеквизиты()
	
	// Если претензия еще не записана - проверять нечего.
	Если Не ЗначениеЗаполнено(Претензия) Тогда
		Возврат Истина;
	КонецЕсли;
	
	РеквизитыПретензии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Претензия, "Организация,Контрагент");
	РезультатФункции = (РеквизитыПретензии.Организация = Объект.Организация) 
									И (РеквизитыПретензии.Контрагент = Объект.Контрагент);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПретензиюЗавершение(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтветПередЗакрытием = ОбновитьПретензию();
		Записать();
	Иначе
		ОтветПередЗакрытием = Неопределено;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не СовпадаютОсновныеРеквизиты() Тогда
		
		Если ОтветПередЗакрытием <> Истина Тогда
			Отказ = Истина;
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ОбновитьПретензиюЗавершение", ЭтаФорма, Параметры);   
			ТекстВопроса = НСтр("ru = 'Организация либо контрагент не совпадают с введенными ранее. Продолжить сохранение?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		КонецЕсли; 
		
	КонецЕсли;   
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнююВерсиюНаСервере(Ссылка, Претензия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХодПретензионноИсковойРаботыСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ХодПретензионноИсковойРаботы.СрезПоследних(, Претензия = &Претензия) КАК ХодПретензионноИсковойРаботыСрезПоследних
	|ГДЕ
	|	ХодПретензионноИсковойРаботыСрезПоследних.Регистратор <> &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХодПретензионноИсковойРаботыСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Претензия", Претензия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();    
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Регистратор;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПениИШтрафыНаСервере()
	
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ОбъектСервер.Заполнить(Объект.Претензия.Основание);
	
	Объект.РасшифровкаПредметаСпора.Загрузить(ОбъектСервер.РасшифровкаПредметаСпора.Выгрузить());    
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства


#КонецОбласти
